In [14]:
%%HTML
<h2 align=center style="color:red;">READ CSV</h2>

In [2]:
import pandas as pd
df = pd.read_csv("stock_data.csv")
df

  stocks data     Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0     tickers            eps    revenue      price         people
1      google          27.82         87        845     larry page
2         wmt           4.61        484         65           n.a.
3        msft             -1         85         64     bill gates
4         ril  not available         50       1023  mukesh ambani
5        tata            5.6         -1       n.a.     ratan tata

**if you want to avoid this that means here headers are not proper because always 1st row is considered as header. So use skiprows property**

In [3]:
df=pd.read_csv("stock_data.csv",skiprows=1)
df

  tickers            eps  revenue price         people
0  google          27.82       87   845     larry page
1     wmt           4.61      484    65           n.a.
2    msft             -1       85    64     bill gates
3     ril  not available       50  1023  mukesh ambani
4    tata            5.6       -1  n.a.     ratan tata

**In case there are no headers written in the csv file ,but you know the headers name so you explicitly provide their names, use first header=none then names, if names are not provided then default 01234 headers will be generated**

In [5]:
df=pd.read_csv("stock_data.csv",header=None)
df

        0              1    2     3              4
0  google          27.82   87   845     larry page
1     wmt           4.61  484    65           n.a.
2    msft             -1   85    64     bill gates
3     ril  not available   50  1023  mukesh ambani
4    tata            5.6   -1  n.a.     ratan tata

**if names are provided then those will be considered as header**

In [6]:
df=pd.read_csv("stock_data.csv",header=None,names=["tickers","eps","revenue","price","people"])
df

  tickers            eps  revenue price         people
0  google          27.82       87   845     larry page
1     wmt           4.61      484    65           n.a.
2    msft             -1       85    64     bill gates
3     ril  not available       50  1023  mukesh ambani
4    tata            5.6       -1  n.a.     ratan tata

 **To read n rows from all, use nrows=n property**

In [7]:
df=pd.read_csv("stock_data.csv",nrows=3)
df

  tickers    eps  revenue  price      people
0  google  27.82       87    845  larry page
1     wmt   4.61      484     65        n.a.
2    msft  -1.00       85     64  bill gates

**while reading csv file if 'not available' or 'n.a.' value is encountered then it should be replaced with NaN. to do that use na_values**

In [8]:
df=pd.read_csv("stock_data.csv",na_values=["not available","n.a."])
df

  tickers    eps  revenue   price         people
0  google  27.82       87   845.0     larry page
1     wmt   4.61      484    65.0            NaN
2    msft  -1.00       85    64.0     bill gates
3     ril    NaN       50  1023.0  mukesh ambani
4    tata   5.60       -1     NaN     ratan tata

**in the revenue column there is a cell with -1 value which is invalid ,so its needed to convert it as NaN.
But it will also convert the eps -1 value to nan, we don't want that. so we will pass dictionary in the na_values input**

In [9]:
df=pd.read_csv("stock_data.csv",na_values=["not available","n.a.",-1])
df

  tickers    eps  revenue   price         people
0  google  27.82     87.0   845.0     larry page
1     wmt   4.61    484.0    65.0            NaN
2    msft    NaN     85.0    64.0     bill gates
3     ril    NaN     50.0  1023.0  mukesh ambani
4    tata   5.60      NaN     NaN     ratan tata

In [10]:
df=pd.read_csv("stock_data.csv",na_values=
              {
                  "eps":["not available","n.a."],
                  "revenue":["not available","n.a.",-1],
                  "price":["not available","n.a.",-1],
                  "people":["not available","n.a.",-1]
              })
df

  tickers    eps  revenue   price         people
0  google  27.82     87.0   845.0     larry page
1     wmt   4.61    484.0    65.0            NaN
2    msft  -1.00     85.0    64.0     bill gates
3     ril    NaN     50.0  1023.0  mukesh ambani
4    tata   5.60      NaN     NaN     ratan tata

In [15]:
%%HTML
<h2 align=center style="color:red;">WRITE INTO CSV</h2>

## the data frame 'df' should be written into a new csv file , use to_csv

In [22]:
df.to_csv("new.csv",index=False)   # new.csv file will be created if not exist and if exist then it must not be open
# index=false is to not take 0123 index

### to write only some columns into file

In [23]:
df.to_csv("new.csv",columns=["tickers","eps"],index=False)

In [24]:
df.to_csv("new.csv",columns=["tickers","eps"],index=False,header=False) #to exclude header use header=False

In [1]:
%%HTML
<h2> hello</h2>

##huiwehf

# ebrfheruf